[
  {
    "id": 90757,
    "title": "O Sol é para Todos",
    "author": "Harper Lee",
    "price": "28",
    "cover": "https://m.media-amazon.com/images/I/91WKPd60P4L._SL1500_.jpg",
    "description": "Nesta emocionante história ambientada no Sul dos Estados Unidos da década de 1930, região envenenada pela violência do preconceito racial, vemos um mundo de grande beleza e ferozes desigualdades através dos olhos de uma menina de inteligência viva e questionadora, enquanto seu pai, um advogado local, arrisca tudo para defender um homem negro injustamente acusado de cometer um terrível crime.",
    "isDestaque": true
  },
  {
    "id": 90750,
    "title": "1Q84",
    "author": "Haruki Murakami",
    "price": "12",
    "cover": "https://m.media-amazon.com/images/I/31Y33PweWWS._SY445_SX342_.jpg",
    "isDestaque": false
  },
  {
    "id": 521238,
    "title": "A Arte da Guerra",
    "author": "Sun Tzu",
    "price": "12,00",
    "cover": "https://m.media-amazon.com/images/I/51Fe45NGwkL._SY466_.jpg",
    "isDestaque": false
  },
  {
    "id": 52038,
    "title": "A Desobediência Civil",
    "author": "Henry David Thoreau",
    "price": "8,00",
    "cover": "https://m.media-amazon.com/images/I/41myzx6BxJL._SY445_SX342_.jpg",
    "isDestaque": false
  },
  {
    "id": 59899,
    "title": "A Ética da Liberdade",
    "author": "Murray Rothbard",
    "price": "42,00",
    "cover": "https://m.media-amazon.com/images/I/71S2v4hDjBL._SY466_.jpg",
    "isDestaque": false
  },
  {
    "id": 58899,
    "title": "Identidade e Diferença",
    "author": "Martin Heidegger",
    "price": "5,00",
    "cover": "https://m.media-amazon.com/images/I/51b00BQ+hvL._SY445_SX342_.jpg",
    "isDestaque": false
  },
  {
    "id": 67799,
    "title": "A Metamorfose",
    "author": "Franz Kafka",
    "price": "14,00",
    "cover": "https://m.media-amazon.com/images/I/41GSDX15NYL._SY445_SX342_.jpg",
    "isDestaque": false
  },
  {
    "id": 975936,
    "title": "Código Limpo",
    "author": "Robert C. Martin",
    "price": "40",
    "cover": "https://m.media-amazon.com/images/I/71JpZHEGvWL._SL1500_.jpg",
    "description": "Mesmo um código ruim pode funcionar. Mas se ele não for limpo, pode acabar com uma empresa de desenvolvimento. Perdem-se a cada ano horas incontáveis e recursos importantes devido a um código mal escrito. Mas não precisa ser assim.\n\nO renomado especialista em software, Robert C. Martin, apresenta um paradigma revolucionário com Código limpo: Habilidades Práticas do Agile Software. Martin se reuniou com seus colegas do Mentor Object para destilar suas melhores e mais ágeis práticas de limpar códigos \"dinamicamente\" em um livro que introduzirá gradualmente dentro de você os valores da habilidade de um profissional de softwares e lhe tornar um programador melhor –mas só se você praticar. ",
    "isDestaque": true
  },
  {
    "id": 352841,
    "title": "O Codificador Limpo",
    "author": "Robert C. Martin",
    "price": "30",
    "cover": "https://m.media-amazon.com/images/I/91lBONZ4tAL._SL1500_.jpg",
    "description": "Então você quer ser um profissional do desenvolvimento de softwares. Quer erguer a cabeça e declarar para o mundo: “Eu sou um profissional!”.\nQuer que as pessoas olhem para você com respeito e o tratem com consideração. Você quer isso tudo.\nCerto?\n\nO termo “Profissionalismo” é, sem dúvida, um distintivo de honra e orgulho, mas também é um marcador de incumbência e responsabilidade, que inclui trabalhar bem e honestamente.",
    "isDestaque": true
  },
  {
    "id": 678060,
    "title": "Entendendo Algoritmos",
    "author": "Aditya Y. Bhargava",
    "price": "28",
    "cover": "https://m.media-amazon.com/images/I/71Vkg7GfPFL._SL1296_.jpg",
    "description": "Um guia ilustrado para programadores e outros curiosos. Um algoritmo nada mais é do que um procedimento passo a passo para a resolução de um problema. Os algoritmos que você mais utilizará como um programador já foram descobertos, testados e provados. Se você quer entendê-los, mas se recusa a estudar páginas e mais páginas de provas, este é o livro certo. Este guia cativante e completamente ilustrado torna simples aprender como utilizar os principais algoritmos nos seus programas. O livro Entendendo Algoritmos apresenta uma abordagem agradável para esse tópico essencial da ciência da computação. Nele, você aprenderá como aplicar algoritmos comuns nos problemas de programação enfrentados diariamente. Você começará com tarefas básicas como a ordenação e a pesquisa. Com a prática, você enfrentará problemas mais complexos, como a compressão de dados e a inteligência artificial. Cada exemplo é apresentado em detalhes e inclui diagramas e códigos completos em Python. Ao final deste livro, você terá dominado algoritmos amplamente aplicáveis e saberá quando e onde utilizá-los. O que este livro inclui A abordagem de algoritmos de pesquisa, ordenação e algoritmos gráficos Mais de 400 imagens com descrições detalhadas Comparações de desempenho entre algoritmos Exemplos de código em Python Este livro de fácil leitura e repleto de imagens é destinado a programadores autodidatas, engenheiros ou pessoas que gostariam de recordar o assunto.",
    "isDestaque": true
  },
  {
    "id": 436344,
    "title": "O programador pragmático",
    "author": "Andrew Hunt & David Thomas",
    "price": "80",
    "cover": "https://m.media-amazon.com/images/I/61hewOW+8zL._SL1500_.jpg",
    "description": "O Programador Pragmático ilustra as melhores práticas e as principais armadilhas do desenvolvimento de software. Destinado a todos envolvidos com programação, de codificadores iniciantes a programadores experientes e gerentes responsáveis por projetos de software, apresenta lições simples que promovem rápidas melhorias na produtividade pessoal, precisão e satisfação profissional.",
    "isDestaque": true
  }
]